[
  {
    "id": 1,
    "title": "သုစိပုဘာ ဝိလိသိဓာ",
    "content": "<p>သုစိပုဘာ ဝိလိသိဓာ</p><p>အက္ခရာစွဲသုံး ဤရှစ်လုံးကို</p><p>သီကုံးပန်းသွင် နေ့တိုင်းဆင်လော့</p><p></p><p>စာသင်ပျိုနု အခြေပြုတို့</p><p>ဥဇုဘူတ လုံ့လပြင်းစွာ</p><p>သူ့ထက်ငါဟု နှုတ်မှာရွရွ ကြိုးပမ်းကလျှင်</p><p>သိပ္ပကျေးဇူး အထူးသိမြင်</p><p>ပညာရှင်ဟု မထင် မပေါ် မကျော်စောဘဲ</p><p>တီမှာလွဲအံ့</p><p></p><p>အရဲကြိုးကုတ် ကြက်ရဲသုတ်သို့</p><p>အားထုတ်ခုံမင်</p><p>မသင်မအံ မကြံမမေး</p><p>ဆွေးနွေးရောနှော</p><p>ဟောပြောမဲ့ထွေ</p><p>ပေချပ်ရေဖြင့် ကုန်စေဆန်းသာ</p><p>သင်ချေပါလည်း</p><p>ဘယ်မှာဂုဏ်ရှင် ကျော်စောထင်လိမ့်</p><p></p><p>စာသင်ဟူက</p><p>ကျမ်းထိုမျှကို တွေ့ကမရှောင်</p><p>ကြောင်ပုစွန်စား ကြွပ်ကြွပ်ဝါးသို့</p><p>လွှသွားပမာ ကျောက်ထက်စာသို့</p><p>လိုရာရအောင် ကြံဆောင်လေ့ကျက်</p><p>အနက် အဓိပ္ပါယ် နှုတ်ဝယ်ရွရွ ထားချေမှတည့်</p><p>တစ်စပေါ်လျှင် ချည်စငင်သို့</p><p>သဘင်ပွဲမှောက် ဆိုရေးရောက်က</p><p>လန့်ကြောက်မရှိ</p><p>သတိမြဲခိုင် ကျောက်တိုင်ပမာ</p><p>ကေသရာသို့ ရွံ့ရှာမဲ့လျှင်</p><p>ဆိုခင်းနည်းနာ အဖြာဖြာကို</p><p>မကြာနှုတ်လျှောက် ခန့်ချင့်ထောက်လော့</p><p></p><p>အံ့လောက်ဖွယ်သာ ဂါထာပါဌ်သား</p><p>စကားဝိုက်လည်</p><p>စဉ်ရှည်ရှေးတီး စကားကြီးက</p><p>စသည်ထိုထို ဝိဂြိုဟ်ဝစနတ် ဓာတ်ရပစ္စည်း</p><p>ထုံးနည်းပမာ</p><p>ဂါထာဆန်းဂိုဏ်း ကရိုဏ်းဌာန်စစ်</p><p>ဖွင့်လှစ်ဋီကာ အဋ္ဌကထာပါဠိ အောက်ထက်ညှိ၍</p><p>ကဝိလက္ခဏာ အဖြာဖြာကို</p><p>သေချာဆည်းဆ ဆိုဝံ့ကလျှင်</p><p>ဘဝဤတွင် ခုမျက်မြင်လည်း</p><p>မထင်ဘယ်မှာ ရှိဘိရာအံ့</p><p>သံသရာလည်း ပမာကဲလွန်</p><p>အဆုံးစွန်မူ ညီမွန်တုလွတ်</p><p>သုံးလူ့နတ်ဝယ်</p><p>အကျွတ်ဘယ်မှာ ဝေးတော့မည်။</p>",
    "color": "#FFF3AA",
    "author": "သျှင်မဟာရဋ္ဌသာရ",
    "type": "ဧကပိုဒ်ရတု",
    "era": "အင်းဝခေတ်"
  },
  {
    "id": 2,
    "title": "တောင်သူကြီး",
    "content": "<p>ခက်ရင်းစွယ်စုံ၊ စိန်တောင်ကြီးနှင့်</p><p>ငါးစီးဆင်ပြောင့်အားပေကို။</p><p></p><p>ဇမ္ဗူစိုးရ နတ်ရှင့်ကျွန်</p><p>တုလို့ချွန်လျှင် ခန္ဓာစဲမယ်</p><p>ရဲရန်ညွန့်ဖြို။</p><p></p><p>ကိုးပိဿာစီး ဓားမကြီး</p><p>ရန်းမီးသတ္တရု ငေါက်လျှင်ပြို</p><p>ကုန်းဘောင်ရွှေဘို ထောင်ကနတ်က</p><p>ဘေးဘိုးစဉ်ဆက် ခုတိုင်အောင်</p><p>ရေးတော်မရှောင် ထမ်းတဲ့ယောက်ျား။</p><p></p><p>ယာလယ်လုပ်လို့ တောမှာပျော်</p><p>စီးပွားထင်ပေါ် ပြောင်းနှင့်စပါး။</p><p></p><p>ပဲမျိုးအပြား ဘူးသခွား</p><p>ကယားမြို့မ နယ်တစ်ခွင်</p><p>ဝါနှမ်းစုံလင် ချဉ်ပေါင်ခင်းနှင့်</p><p>မကြွင်းခရမ်း သီးမျိုးလျှမ်း</p><p>ပိုက်တန်းစည်းဝိုက် ရွှေယုန်ထောင်ကာ</p><p>ချိုးနှင့်ငုံး စာငယ်ကိုလေ</p><p>ပုတက် မွှေးကြိုင်စွာ</p><p>ဇွန်လုံး ထိန်ထိန်ဝါ။</p><p></p><p>ရေယဉ်စီးတဲ့ တောမြိုင်သာ</p><p>ပြောင်းပဲရောရာ ဆန်တစ်ဝက်ကယ်နှင့်</p><p>စပျစ်ကျင်းလျက် ပြည့်အနှက်</p><p>လူပျိုချက်တဲ့ ဟင်းလျာကို</p><p>ရောရာစုံ ချိုလှချည့်</p><p>အပျိုငယ် ရွှေနံကားအောင်</p><p>စားပါလှည့် ဗုန်းဗော။</p>",
    "color": "#FFD0A8",
    "author": "ဖိုးသူတော်ဦးမင်း",
    "type": "ဒုံးချင်း",
    "era": "ကုန်းဘောင်ခေတ်"
  },
  {
    "id": 3,
    "title": "ဘုန်းနှင့်ကံနှင့် ရွှေသဇင်",
    "content": "<p>စိမ့်ကြီးမြိုင်ကြီး၊ ရိပ်ကြီးတောတောင်</p><p>နေရောင်မခံ၊ ပန်းပျံပင်ဆင့်</p><p>မြေနှင့်ရန်ဘက်၊ ခက်လက်စိမ်းမြ</p><p>မိုးမခဘူး၊ နွေလသန်ပေါက်</p><p>ယဉ်ချိန်ရောက်ခါမှ၊ နှင်းသောက်ကယ်ရွှင်ရွှင်</p><p>ပွင့်ဖူးတွေ ဆင်ကြသည်။</p><p></p><p>ရွှေပင်ဆင့်ငွေပင်ဆင့်၊ ပတ္တမြားပင်ဆင့်</p><p>ဂမုန်းအင့်အဖက်</p><p>ဆောင်းစက်ရိပ်ခို၊ ရေတွက်လို့ဆိုတော့မည်။</p><p></p><p>လက်တံတိုတစ်မည်၊ လက်တံရှည်နှင့်</p><p>နေရောင်ခြည် လရောင်ဝါ</p><p>မိုးလုံးပြာ မိုးလုံးမှိုင်း</p><p>ပုလဲဆိုင်း ပုလဲနှစ်</p><p>ချစ်စရာ့ လိပ်ပြာတောင်</p><p>နီလာရောင် တောင်လုံးမြိုင်</p><p>သုံးပွင့်ဆိုင် ခိုင်လုံးဆန်း</p><p>ပင်လုံးလန်း နွဲ့တန်းယိမ်း</p><p>ညှာတံစိမ်းများတို့</p><p>လေသိမ်းတိုင်းလှ၊ ကိန္နရီကသည့်နှယ်</p><p>တချို့ကနီပြာပြာ၊ တချို့ကဖြူဝါဝါ</p><p>တချို့မှာချိပ်ပွင့်၊ တချို့မှာပန်းရင့်ကို</p><p>ပင်ဆင့်ပန်းပျံ၊ ဘွဲ့မည်ရည်ခံချင်းတွင်</p><p>ဝေယန်နန်းမြင့်၊ ပန်းတိုင်းတင့်မို့</p><p>မြို့ဝန်မင်းစာ၊ လိပ်မပါဘဲ</p><p>ကွယ်ရာဈေးပြင်၊ ရောင်းလို့များမြင်မလား။</p><p></p><p>သေချင်သေ၊ ရှင်ချင်ရှင်</p><p>အင်မတန့် အင်မတန်၊ ရာဇဝတ်တော်ခံရမည်။</p><p></p><p>မြတ်ပန်တော်ပန်း၊ ခိုင်လုံးလန်းကို</p><p>ဟိုလောင်ပန်းပွင့်၊ ဘယ်ဂုဏ်ကြောင့် ဝင့်မတုံး</p><p>ဘုန်းနှင့်ကံနှင့်ရွှေသဇင်။</p>",
    "color": "#FFB1B1",
    "author": "ဦးတိုး",
    "type": "ရကန်",
    "era": "ကုန်းဘောင်ခေတ်"
  },
  {
    "id": 4,
    "title": "တောဒဟတ်ပန်း",
    "content": "<p>ယဉ်မရိုင်း၊</p><p>အင်တိုင်းရယ်တဲ့ ခပ်ဆန်ဆန်။</p><p></p><p>လူမရောက်၊</p><p>ဂူ ကျောက်ချောင် တောင်ကတုံးမှာ၊</p><p>စုရုံးကာ သူတို့ ပေါက်ရှာကြ၊</p><p>အခေါက်ဖြူဖြူကလေးရယ်နှင့်၊</p><p>အခြောက်ကြူကြူ မွှေးရှာဘု၊</p><p>ကျေးငှက် ပျော်စံ။</p><p></p><p>ဇလပ်ဝါ ခတ္တာ ခ,ပါတဲ့၊</p><p>သာတန်ဆောင် ဝါခေါင်လတွင်မှ၊</p><p>ပွင့်ဖူးကြ အချိန်မှန်၊</p><p>ဝသန္တလေချိုဖျန်း။</p><p></p><p>ယဉ်မဆုံးနိုင်ဘု၊</p><p>ပင်လုံးကုန် ခိုင်ညှာတံမတော့၊</p><p>နံ့သာကျံ ဝါ ဖန် နှောပါလို့၊</p><p>လောကဓာတ်ခန်းမှာလ၊</p><p>ပြောစမှတ် ဆန်းပေရဲ့</p><p>တော ဒဟတ်ပန်း။ ။</p>",
    "color": "#D9D1FF",
    "author": "ဦးကြော့",
    "type": "လေးချိုး",
    "era": "ကုန်းဘောင်ခေတ်"
  },
  {
    "id": 5,
    "title": "လှည်းယာဉ်",
    "content": "<p>ယဉ်မရိုင်း၊</p><p>အင်တိုင်းရယ်တဲ့ ခပ်ဆန်ဆန်။</p><p></p><p>လူမရောက်၊</p><p>ဂူ ကျောက်ချောင် တောင်ကတုံးမှာ၊</p><p>စုရုံးကာ သူတို့ ပေါက်ရှာကြ၊</p><p>အခေါက်ဖြူဖြူကလေးရယ်နှင့်၊</p><p>အခြောက်ကြူကြူ မွှေးရှာဘု၊</p><p>ကျေးငှက် ပျော်စံ။</p><p></p><p>ဇလပ်ဝါ ခတ္တာ ခ,ပါတဲ့၊</p><p>သာတန်ဆောင် ဝါခေါင်လတွင်မှ၊</p><p>ပွင့်ဖူးကြ အချိန်မှန်၊</p><p>ဝသန္တလေချိုဖျန်း။</p><p></p><p>ယဉ်မဆုံးနိုင်ဘု၊</p><p>ပင်လုံးကုန် ခိုင်ညှာတံမတော့၊</p><p>နံ့သာကျံ ဝါ ဖန် နှောပါလို့၊</p><p>လောကဓာတ်ခန်းမှာလ၊</p><p>ပြောစမှတ် ဆန်းပေရဲ့</p><p>တော ဒဟတ်ပန်း။ ။</p>",
    "color": "#B7EFFF",
    "author": "အမည်မသိရှေးစာဆို",
    "type": "လေးချိုး",
    "era": ""
  },
  {
    "id": 6,
    "title": "မြင်စိုင်းရွှေပြည်",
    "content": "<p>တာဝတိံသာ၊ နတ်ရွာလော၊ နတ်ရွာလော။</p><p>ဟုတ်တည်း ရှင်ချင်း ရှင်ချင်း။</p><p>ဟုတ်တည်း ဆွေရင်း ဆွေရင်း။</p><p>ဟုတ်တည်း သည်ရင်း သည်ရင်း။</p><p>မြင်စိုင်းဟူသည်၊ ရွှေပြည် ရွှေပြည်။</p><p>မြင်စိုင်းရွှေမြေ၊ ပန်းသင်းခွေ</p><p>ပင်ခြေချုံထက်နွယ်၊ ချုံထက်နွယ်။</p><p>တောင်လေရှုန်းရှုန်း၊ မိုးခတ်အုန်း။</p><p>ကင်ပုန်းပွင့်ချီချယ် ပွင့်ချီချယ်။</p><p>နွယ်ပန်းခွာညို၊ ပွင့်ပေလို</p><p>ပြာသိုဆောင်းလလယ်၊ ဆောင်းလလယ်။</p><p>တောင်ထွတ်ဖျားဆီ၊ ရွှေစာတီ။</p><p>သရီရဓာတ်စွယ်၊ သရီရဓာတ်စွယ်။</p><p>ယာဆီမြေကောင်း၊ ကျသည့်ပြောင်း။</p><p>မနှောင်းမှည့်ဆောလွယ်၊ မှည့်ဆောလွယ်။</p><p>ခါနှင့်ဘုတ်ချိုး၊ ကြက်တောမျိုး</p><p>လိုစိုးကျက်မြေကျယ်၊ ကျက်မြေကျယ်။</p><p>ယှဉ်ဖော်မဝေး၊ ဖော်ရွှေကျေး။</p><p>စာနွှေးစားလိုဖွယ်၊ စားလိုဖွယ်။</p><p>ယရည်းသွန်းသွန်း၊ မြင်းသည်ဝန်း</p><p>လှံချွန်းတွန်းတက်ပယ်၊ တွန်းတက်ပယ်။</p><p>စောလူးစီးတန်၊ မျိုးဆက်ဒန်</p><p>လျင်ထန်မြင့်မဆွယ်၊ မြင့်မဆွယ်။</p><p>မြှောက်စည်လတီး၊ ဝင်ခါနီး</p><p>စောထီးနန်းထက်ကျယ်၊ နန်းထက်ကျယ်။</p><p>သာသည့်မြေပြင်၊ စောနတ်ရှင်</p><p>နန်းခွင်ရှုတင့်တယ်၊ ရှုတင့်တယ်။</p><p>အထူးလော၊ တက်တိမ်လော၊ နေရောင်လော။</p>",
    "color": "#D5FFB5",
    "author": "ငါးစီးရှင်ကျော်စွာ",
    "type": "ကာချင်း",
    "era": "ပင်းယခေတ်"
  },
  {
    "id": 7,
    "title": "သင်သေသွားသော်",
    "content": "<p>သြော် ... လူ့ပြည်လောက၊ လူ့ဘဝကား</p><p>အိုရနာရ၊ သေရဦးမည်</p><p>မှန်ပေသည်တည့်။</p><p></p><p>သို့တပြီးကား၊ သင်သေသွားသော်</p><p>သင်ဖွားသောမြေ၊ သင်တို့မြေသည်</p><p>အခြေတိုးမြင့်၊ ကျန်ကောင်းသင့်၏။</p><p></p><p>သင်၏မျိုးသား၊ စာစကားလည်း</p><p>ကြီးပွားတက်မြင့်၊ ကျန်ကောင်းသင့်၏။</p><p>≈</p><p>သင်ဦးချ၍ အမျှဝေရာ</p><p>စေတီသာနှင့်၊ သစ္စာအရောင်</p><p>ဉာဏ်တန်ဆောင်လည်း</p><p>ပြောင်လျက်ဝင်းလျက် ကျန်စေသတည်း။</p>",
    "color": "#BCBCBC",
    "author": "ဇော်ဂျီ",
    "type": "ခေတ်စမ်းလင်္ကာ",
    "era": "ကိုလိုနီခေတ်"
  }
]