<template>
  <div id="contents">
    <PoemCard
      v-for="poem in poems"
      :key="poem.id"
      :title="poem.title"
      :content="poem.content"
      :poet="poem.author"
      :type="poem.type"
      :era="poem.era"
      :color="poem.color"
    />
  </div>
</template>

<script>
import MagicGrid from 'magic-grid'
import PoemCard from '@/components/PoemCard.vue'

export default {
  name: 'Main',
  components: {
    PoemCard
  },
  data () {
    return {
      grid: null,
      poems: [
        {
          id: 1,
          title: 'ရွှေနှင့်ယိုးမှား ပန်းစကား',
          content: '<p>သိုးကလေ</p> <p>ပုပ္ပားနတ်တောင်</p> <p>အခေါင်မြင့်ဖျား စုံတောပြား၌</p> <p>နံ့ရှာကြိုင်လွင့်၊​ ခါတံပွင့်သည်</p> <p>ရွှေနှင့်ယိုးမှား ပန်းစကား။</p>',
          color: '#f28ef0',
          author: 'အမည်မသိရှေးစာဆို',
          type: 'အလင်္ကာ',
          era: 'အင်းဝခေတ်'
        },
        {
          id: 2,
          title: 'နွေဦးကာလ မြူထသောခါ',
          content: '<p>နွေဦးကာလ၊ မြူထသောခါ</p> <p>ရင်းထောင်ရင်းဆွဲ၊ ဆောင်မြဲအိုးလွယ်ကာ</p> <p>ဓားနှီးထက်စွာ၊ ခါးမှာချပ်လျက်</p> <p>ထန်းပွင့်ထန်းခိုင်၊ ရွှန်းမြိုင်မြိုင်</p> <p>ကလိုင်သာလွယ်လို့၊ တက်သည်နှင့်လေး။</p><br/> <p>ထန်းပင်ထန်းလက်၊ ထန်းရွက်ကယ်ဝေဝေ</p> <p>စင်အောင်ခုတ်ထစ်၊​ နုမျစ်ကယ် ထန်းဦးရေ</p> <p>မယားငယ်ဆွေ၊ ထန်းရေသိမ်းဆည်း</p> <p>သားမြေးဟစ်ကြော်၊​ ခွေးဝက်ကယ်ခေါ်</p> <p>ထန်းလျှော်သာ၊ ယုန်ပိုက်စည်းငယ်နှင့်လေး။</p>',
          color: '#8bf4e1',
          author: 'ဝန်ကြီးပဒေသရာဇာ',
          type: 'တျာချင်း',
          era: 'ပုဂံခေတ်'
        },
        {
          id: 3,
          title: 'ဘုန်းနှင့်ကံနှင့် ရွှေသဇင်',
          content: '<p>စိမ့်ကြီးမြိုင်ကြီး၊ ရိပ်ကြီးတောတောင်</p> <p>နေရောင်မခံ၊ ပန်းပျံပင်ဆင့်</p> <p>မြေနှင့်ရန်ဘက်၊ ခက်လက်စိမ်းမြ</p> <p>မိုးမခဘူး၊ နွေလသန်ပေါက်</p> <p>ယဉ်ချိန်ရောက်ခါမှ နှင်းသောက်ကယ်ရွှင်ရွှင်</p> <p>ပွင့်ဖူးတွေ ဆင်ကြသည်။</p> <br/> <p>ရွှေပင်ဆင့်ငွေပင်ဆင့်၊ ပတ္တမြားပင်ဆင့်</p> <p>ဂမုန်းအင့်အဖက်</p> <p>ဆောင်းစက်ရိပ်ခို၊ ရေတွက်လို့ဆိုတော့မည်။</p>',
          color: '#ffff8c',
          author: 'ဦးတိုး',
          type: 'ရကန်',
          era: 'ပင်းယခေတ်'
        },
        {
          id: 4,
          title: 'ချိုပေစွဟင်းချို',
          content: '<p>တောင်ခါးပန်းရယ်နှင့်၊</p> <p>ခင်တန်းငယ်ကုန်းမြှောင်၊</p> <p>ကျော့ကွင်းကိုထောင်သည်၊</p>​ <p>ခွေးညီနောင်တစ်ခင်ခင်နှင့်၊</p>​ <p>ယုန်ရှင်ကိုဖမ်းခဲ့ပါ့၊</p> <p>လေးထမ်းတဲ့သည်ဖေကို၊​</p> <p>တဲအိမ်နေကြင်သူက၊</p> <p>တအူအူဟစ်အော်လို့၊</p>​ <p>အမှာတော်ပါးလိုက်ရှာတယ်လေး။</p>',
          color: '#7093e0',
          author: 'ဦးကြီး',
          type: 'လွမ်းချင်း',
          era: 'ကုန်းဘောင်ခေတ်'
        },
        {
          id: 5,
          title: 'မြင်စိုင်းရွှေပြည်',
          content: '<p>တာဝတိံသာ နတ်ရွာလော နတ်ရွာလော။</p> <p>ဟုတ်တည်း ရှင်ချင်း ရှင်ချင်း။</p> <p>ဟုတ်တည်း ဆွေရင်း ဆွေရင်း။</p> <p>ဟုတ်တည်း သည်ရင်း သည်ရင်း။</p> <p>မြင်စိုင်းဟူသည် ရွှေပြည် ရွှေပြည်။</p> <p>မြင်စိုင်းရွှေမြေ ပန်းသင်းခွေ။​</p> <p>မြင်စိုင်းရွှေမြေ ပန်းသင်းခွေ</p> <p>ပင်ခြေ ခြုံထက်နွယ် ခြုံထက်နွယ်။</p> <p>တောင်လေရှုန်းရှုန်းမိုးခတ်အုန်း။</p> <p>ကင်ပုန်းပွင့်ချီချယ် ပွင့်ချီချယ်။</p>',
          color: '#91ddf2',
          author: 'ငါးစီးရှင်ကျော်စွာ',
          type: 'ကာချင်း',
          era: 'ပင်ယခေတ်'
        },
        {
          id: 6,
          title: 'ဒဟတ်ပန်း',
          content: '<p>ယဉ်မရိုင်း၊</p> <p>အင်တိုင်းရယ်တဲ့ ခပ်ဆန်ဆန်။</p>​ <p>လူမရောက်၊</p> <p>ဂူ ကျောက်ချောင် တောင်ခေါင်းတုံးမှာ၊</p> <p>စုရုံးကာ သူတို့ပေါက်ရှာကြ၊</p>​ <p>အခေါက်ဖြူဖြူကလေးရယ်နှင့်၊</p> <p>အခြောက်ကြူကြူ မွှေးရှာဘု၊</p>​ <p>ကျေးငှက် ပျော်စံ။</p>',
          color: '#aeff8c',
          author: 'နတ်မောက် ဦးကြော့',
          type: 'လေးချိုး',
          era: 'ကုန်ဘောင်ခေတ်'
        },
        {
          id: 7,
          title: 'လှည်းယဉ်',
          content: '<p>ခလောက်ကလေးရယ်တဲ့ ဒိုးဒိုးဒေါင်။</p> <p>ပျိုတို့မောင် ယာမလုပ်တယ်​၊</p> <p>ဝါးခုတ်တဲ့တောင်။</p> <br/> <p>နွားညီနောင်၊</p> <p>စည်အောင်ပ ဖေကျောင်း။</p> <br/> <p>မောင်နဲ့မယ် တူယှဉ်တွဲကာမှ၊</p> <p>ယူငင်ကာ ခြူဆင်ဆွဲလို့ရယ်၊​</p> <p>လှည်းယဉ်နဲ့မောင်း။</p>',
          color: '#fcb5c3',
          author: 'ဦးပုည',
          type: 'Something',
          era: 'ရတနာပုံခေတ်'
        },
        {
          id: 8,
          title: 'ပျားနှင့် ပိတုန်း',
          content: '<p>ရွှေစံပယ် ရင်ခတ်နှင့်</p> <p>ဇလပ် ဇီဇဝါ</p> <p>သင်းရနံ့ဖြာ။</p> <br/> <p>လေဖြူးငယ်လာ</p> <p>လေညာကစုရုံး။</p> <br/> <p>ပွင့်ဝတ် ညှာတံ ချူလို့</p> <p>လူလိုပင် သယ်ဆောင်သွားရှာကြ</p> <p>ပျားနှင့်ပိတုန်း။</p>',
          color: '#f473b3',
          author: 'အမည်မသိ ရှေးစာဆို',
          type: 'Something',
          era: 'ကိုလိုနီခေတ်'
        },
        {
          id: 9,
          title: 'လက်ဆောင်',
          content: '<p>မဝယ်ဘူး မယ်ခူးတဲ့ဖက်စို</p> <p>မီးမကူ နေပူမှာမကင်အားလို့</p> <p>ထားရတယ် အိပ်ရာအောက်မှာ</p> <p>မင်းသောက်ဖို့ကို။</p> <br/> <p>ညှာအနား ရှေ့သွားနှင့် ကိုက်လို့တို</p> <p>မချိုတောင့် လိပ်ဆေး။</p> <br/> <p>ပိုမကူ၊ ဝါချည်ဖြူ တစ်ပင်ရစ်ကယ်နှင့်</p> <p>ငယ်ချစ်မောင် ရွှေဝသွားကို</p> <p>ပါးလိုက်ကဲ့လေး။</p>',
          color: '#adffe3',
          author: 'မယ်ခွေ',
          type: 'လေးချိုး',
          era: 'ကုန်းဘောင်ခေတ်'
        }
      ]
    }
  },
  computed: {
    gutter () {
      return (window.innerWidth <= 576) ? 7 : 15
    }
  },
  mounted () {
    this.grid = new MagicGrid({
      container: '#contents',
      static: false,
      animate: true,
      items: 9,
      maxColumns: 6,
      gutter: this.gutter
    })

    this.grid.positionItems()

    const events = ['load', 'resize']

    events.forEach(element => {
      window.addEventListener(element, () => {
        this.grid.positionItems()
      })
    })
  }
}
</script>
