<template>
  <div id="poem-detail">
    <section class="heading">
      <h1 class="title">တောင်သူကြီး</h1>
      <div class="info">
        <span>ဖိုးသူတော် ဦးမင်း</span><span>ဒုံးချင်း</span>
      </div>
      <div class="content">
        <p>ခက်ရင်းစွယ်စုံ၊ စိန်တောင်ကြီးနှင့်</p>
        <p>ငါးစီးဆင်ပြောင့်အားပေကို။</p>
        <p></p>
        <p>ဇမ္ဗူစိုးရ နတ်ရှင့်ကျွန်</p>
        <p>တုလို့ချွန်လျှင် ခန္ဓာစဲမယ်</p>
        <p>ရဲရန်ညွန့်ဖြို။</p>
        <p></p>
        <p>ကိုးပိဿာစီး ဓားမကြီး</p>
        <p>ရန်းမီးသတ္တရု ငေါက်လျှင်ပြို</p>
        <p>ကုန်းဘောင်ရွှေဘို ထောင်ကနတ်က</p>
        <p>ဘေးဘိုးစဉ်ဆက် ခုတိုင်အောင်</p>
        <p>ရေးတော်မရှောင် ထမ်းတဲ့ယောက်ျား။</p>
        <p></p>
        <p>ယာလယ်လုပ်လို့ တောမှာပျော်</p>
        <p>စီးပွားထင်ပေါ် ပြောင်းနှင့်စပါး။</p>
        <p></p>
        <p>ပဲမျိုးအပြား ဘူးသခွား</p>
        <p>ကယားမြို့မ နယ်တစ်ခွင်</p>
        <p>ဝါနှမ်းစုံလင် ချဉ်ပေါင်ခင်းနှင့်</p>
        <p>မကြွင်းခရမ်း သီးမျိုးလျှမ်း</p>
        <p>ပိုက်တန်းစည်းဝိုက် ရွှေယုန်ထောင်ကာ</p>
        <p>ချိုးနှင့်ငုံး စာငယ်ကိုလေ</p>
        <p>ပုတက် မွှေးကြိုင်စွာ</p>
        <p>ဇွန်လုံး ထိန်ထိန်ဝါ။</p>
        <p></p>
        <p>ရေယဉ်စီးတဲ့ တောမြိုင်သာ</p>
        <p>ပြောင်းပဲရောရာ ဆန်တစ်ဝက်ကယ်နှင့်</p>
        <p>စပျစ်ကျင်းလျက် ပြည့်အနှက်</p>
        <p>လူပျိုချက်တဲ့ ဟင်းလျာကို</p>
        <p>ရောရာစုံ ချိုလှချည့်</p>
        <p>အပျိုငယ် ရွှေနံကားအောင်</p>
        <p>စားပါလှည့် ဗုန်းဗော။</p>
      </div>
    </section>
  </div>
</template>
